import vector as vt

# к моменту начала с этим блоком мы уже должны находиться в СО, связанной с луной
def aiming(ship, moon_position_x, moon_position_y, slope):
# корабль, позиция необходимой точки на Луне, угловой коэффициент касательной к этой точке в ДСК
    
# TODO учесть вращение Луны вокруг своей оси (или понять, почему этого не нужно делать)
# TODO после перехода в СО связанной с Землёй, рассчитать положение точки на Луне
# TODO рассчитать уравнение касательной к Луне в эттой точке
# TODO сделать приемлемое изменение скорости
